Revit 2027 API
BuiltInFailures.StairRampFailures.CannotCreateCornerBalusters Property
 Can't create corner Baluster
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateCornerBalusters { get; }
Public Shared ReadOnly Property CannotCreateCornerBalusters As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateCornerBalusters {
	FailureDefinitionId^ get ();
}
static member CannotCreateCornerBalusters : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace